<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"55f47e3feab9778746bb1a917b092933813f497d2bf035be6789daec9c36dbe2","plan_job_ref":"Job Terraform Plan #31 at https://github.com/NiyiOdumosu/confluent-cloud-infra/actions/runs/5669562469","plan_hash":"b57997e21f3b00217ff2bc43171f3d8ee28c062c590be63d777b8ce18c3443c6","plan_text_format":"text","version":"1.36.1"} -->
Terraform plan in __non-prod/public/kafka__
With var files: `non-prod/public/non-prod.tfvars`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # confluent_kafka_cluster.dedicated will be created
  + resource "confluent_kafka_cluster" "dedicated" {
      + api_version        = (known after apply)
      + availability       = "SINGLE_ZONE"
      + bootstrap_endpoint = (known after apply)
      + cloud              = "AWS"
      + display_name       = "non-prod"
      + id                 = (known after apply)
      + kind               = (known after apply)
      + rbac_crn           = (known after apply)
      + region             = "us-east-1"
      + rest_endpoint      = (known after apply)

      + dedicated {
          + cku   = 2
          + zones = (known after apply)
        }

      + environment {
          + id = "env-rvw7k"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_version        = (known after apply)
  + bootstrap_endpoint = (known after apply)
  + environment_id     = "*********"
  + id                 = (known after apply)
  + kind               = (known after apply)
  + rbac_crn           = (known after apply)
  + region             = "us-east-1"
  + rest_endpoint      = (known after apply)
```
</details>

:memo: Plan generated in [Terraform Plan #31](https://github.com/NiyiOdumosu/confluent-cloud-infra/actions/runs/5669562469)